---
kind: method
id: M:Autodesk.Revit.UI.ExternalApplicationArray.Append(Autodesk.Revit.UI.IExternalApplication)
source: html/c9ce5ae5-dc57-057a-7810-8f040434971f.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.Append Method

Add the item to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	IExternalApplication item
)
```

## Parameters
- **item** (`Autodesk.Revit.UI.IExternalApplication`) - The item to be added.